// Вывести в консоль все чётные числа от 0 до 100, включая 0.

for num in 0...100 where num % 2 == 0 {
    print(num)
}

// Создать две переменных: одна равна 7, другая 20.
// Если результат перемножения этих переменных больше 10, то вывести в консоль первую переменную, в противном случае вывести вторую.

let a = 7
let b = 20
a*b>10 ? print(a) : print (b)

// Создайте переменную “k”, равную 9. В диапазоне от 10 до 50, но только по нечётным числам, если текущее число плюс “k” — чётное, то увеличьте “k” на 2, в противном случае выведите в консоль “Next” и перейдите к следующей итерации.

var k = 9

for i in 10...50 where i % 2 != 0 {
    switch (i + k) % 2 {
    case 0:
        k += 2
    default:
        print("Next")
        continue
    }
}

// Создайте переменную “k”, равную 9. В диапазоне от 10 до 50, но только по нечётным числам, если текущее число плюс “k” — чётное, то увеличьте “k” на 1, в противном случае выведите в консоль “Next” прекратите выполнение цикла.

var k = 9

for i in 10...50 where i % 2 != 0 {
    if (i + k) % 2 == 0 {
        k += 1
        }
    else{
        print("Next")
        break
    }
}